app/controllers/posts_controller.rb

	def create

		@post = Post.new(post_params)

		result = false
		message = ''

		if @post.save
---
INSERT INTO "posts" ("created_at", "text", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 28 Dec 2013 04:21:27 UTC +00:00], ["text", "カイピーリーニャだよーん"], ["updated_at", Sat, 28 Dec 2013 04:21:27 UTC +00:00]]

	def show

		total = Post.count
		random = Random.new()
		result = {};

		if total > 0

			data = Post.find(:all, conditions: ['id = ?', random.rand(total) + 1]);
---
SELECT COUNT(*) FROM "posts"
SELECT "posts".* FROM "posts" WHERE (id = 1)